Revit 2027 API
MacroEnvironment Enumeration
 The Macro environments.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum MacroEnvironment
Public Enumeration MacroEnvironment
public enum class MacroEnvironment
type MacroEnvironment
Members
Member name | Value | Description
DB | 1 |  The DB environment.
UI | 2 |  The UI environment.
See Also
Reference
Autodesk.Revit.DB.Macros Namespace